Revit 2027 API
InSessionViewSheetSet.SheetOrganizationId Property
ElementId to the BrowserOrganization for sheets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ElementId SheetOrganizationId { get; set; }
Public Overridable Property SheetOrganizationId As ElementId
	Get
	Set
public:
virtual property ElementId^ SheetOrganizationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
abstract SheetOrganizationId : ElementId with get, set
override SheetOrganizationId : ElementId with get, set
Property Value
ElementId
Implements
IViewSheetSet.SheetOrganizationId
Exceptions
Exception | Condition
ArgumentException |  Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible.
See Also
Reference
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace